Repository: ESUCC/Maximd
Catalog: application/translation/form002/page1.tmx
Source language: es
Languages: en

source: Marcar todo lo que sea pertinente a este reporte de MDT (de equipo multidisciplinario)
en: Check all that apply to this MDT Report

source: Esta evaluación constó de procedimientos que fueron utilizados para determinar si el niño tiene una discapacidad y para determinar la naturaleza y el grado de educación especial y servicios relacionados que serán proporcionados si el niño es elegible.
en: The evaluations consisted of procedures that were used to determine whether the child has a disability and the nature and the extent of the special education and related services that will be provided, if the child qualifies.

source: Fecha del MDT
en: Date MDT

source: Fecha de la notificación
en: Date Notice

source: El niño nunca ha sido verificado
en: Student Has Never Verified

source: Verificación inicial
en: Initial Verification

source: Esta es una verificación inicial de Educación Especial según el 92 NAC 51 (Norma 51)
en: This an initial Special Education verification according to 92 NAC 51 (Rule 51)

source: No se encuentra la fecha de la verificación inicial. Por favor agregar.
en: Initial Verification date not found. Please add

source: Marcar A o B
en: Check either A or B

source: Explicación
en: Explanation

source: Resumen de la información obtenida
en: Summary of data obtained

source: Fecha de la verificación inicial
en: Initial Verification Date

source: Procedimientos y materiales de la evaluación
en: Testing materials and procedures

source: Finalización del MDT
en: MDT completion

source: Es esta una verificación inicial de Educación Especial según el 92 NAC 51 (Norma 51)
en: Is this an initial Special Education verification according to 92 NAC 51 (Rule 51):

source: Nunca se verificó
en: Never Verified

source: Los materiales y procedimientos seleccionados y utilizados para la evaluación de ninguna manera discriminarón contra razas or culturas.
en: The testing materials and procedures selected and administered were not racially or culturally discriminatory.

source: Los materiales y procedimientos utilizados para la evaluación de niños cuyo dominio del inglés es limitado fueron seleccionados y utilizados para asegurar que se midiera el grado hasta el cual el niño tiene una discapacidad y necesita educación especial, más no para medir las destreza del niño con el idioma inglés.
en: Materials and procedures used to assess a child with limited English proficiency were selected and administered to insure that they measure the extent to which the child has a disability and needs special education, rather than measuring the child's English language skills.

source: Se utiliza una variedad de estrategias y herramientas de evaluación para recolectar información funcional, de desarrollo y académica pertinente sobre el niño/a, incluyendo información proporcionada por los padres e información relacionada que permita que el niño/a esté involucrado y progrese en el programa de educación regular (para niños en programas pre-escolares, para que participen en actividades apropiadas) que pueda ayudar a determinar si el niño/a tiene una discapacidad según el 92 NAC 51 (Norma 51), y el contenido del IEP o IFSP del niño/a.
en: A variety of assessment tools and strategies are used to gather relevant functional, developmental and academic information about the child, including information provided by the parent, and information related to enabling the child to be involved in and progress in the general education curriculum (or for a preschool child, to participate in appropriate activities), that may assist in determining whether the child is a child with a disability according to 92 NAC 51 (Rule 51), and the content of the child's IEP or IFSP.

source: Toda la información de datos obtenida de los padres fue considerada con el propósito de tomar la decisión de verificación.
en: All data information obtained from the parent was considered for the purpose of making the verification decision.

source: Los instrumentos utilizados para completar la evaluación del MDT (equipo multidisciplinario) han sido verificados para el propósito específico para el cual fueron utilizados.
en: Instruments used to complete the MDT evaluation have been validated for the specific purpose for which they were used.

source: La evaluación del MDT (equipo multidisciplinario) fue completada en el lenguaje y formato más apropiado para que los resultados proporcionen información acertada sobre qué es lo que el niño sabe y puede hacer en áreas académicas, de desarrollo y funcional.
en: The MDT evaluation was completed in the language and form most likely to yield accurate information on what the child knows and can do academically, developmentally and functionally.

source: No fue posible completar la evaluación del MDT (equipo multidisciplinario) en el idioma materno o predominante u otra modalidad de comunicación del niño/a.
en: It was not feasible to complete the MDT evaluation in the child's predominant or native language or other mode of communication.

source: Sí
en: Yes
